simulations/theta-beta-m/highres_mach3/alpha-20/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          300;
        startFace       717700;
    }
    outlet
    {
        type            patch;
        nFaces          300;
        startFace       718000;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1600;
        startFace       718300;
    }
    top_fore
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1000;
        startFace       719900;
    }
    top_wake
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       720900;
    }
    bottom_fore
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1000;
        startFace       721100;
    }
    bottom_wake
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       722100;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          720000;
        startFace       722300;
    }
)

// ************************************************************************* //
